public class Lesson12 {
  public static void main(String[] args) {
    // メソッド

    // アクセス修飾子 (どこからアクセスできるか決めるもの)
    // public (他のクラスからアクセル可能)
    // protected (同一パッケージ、サブクラスからアクセス可能)
    // 指定なし (同一パッケージからアクセス可能)
    // private (「同一クラス」からアクセス可能)

    // その他の修飾子
    // static (クラス(をインスタンス化しなくても)から直接呼び出し可能)
    // abstract (インスタンス不可)
    // final (上書き不可(クラス上書きできない))

    // 戻り値の型
    // void (戻り値がないメソッドの時に記述)
    // int (戻り値が数値型の時)
    // String (戻り値が文字列)

    // メソッド名
    // main (Javaのメソッドには必ず記述)
    // avg (自作の名を記述(mainメソッド以外に、自分でメソッドを作る場合
    // ここに自分で作ったメソッド名を記述))

    // 引数の型
    // main関数の場合、Sting[] argsを書くのが一般的

  }
}
